In [3]:
import pandas as pd
import numpy as np
df = pd.read_csv('titanic.txt')
result = df.info()
print(result)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB
None

In [6]:
import pandas as pd
import numpy as np
df = pd.read_csv('titanic.txt')
print("List of columns:")
print(df.columns)
print("\nShape of the Dataset:")
print(df.shape)
print("\nData types of the Dataset:")
print(df.dtypes)

List of columns:
Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Siblings/Spouses Aboard',
       'Parents/Children Aboard', 'Fare'],
      dtype='object')

Shape of the Dataset:
(887, 8)

Data types of the Dataset:
Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

In [35]:
df = pd.read_csv('titanic.txt')
df.pivot_table(index=["Sex", "Age"])

                   Fare  Parents/Children Aboard    Pclass  \
Sex    Age
female 0.75   19.258300                 1.000000  3.000000
       1.00   13.437500                 1.500000  3.000000
       2.00   40.261900                 1.428571  2.571429
       3.00   29.373633                 1.333333  2.666667
       4.00   22.828340                 1.200000  2.600000
...                 ...                      ...       ...
male   70.00  40.750000                 0.500000  1.500000
       70.50   7.750000                 0.000000  3.000000
       71.00  42.079200                 0.000000  1.000000
       74.00   7.775000                 0.000000  3.000000
       80.00  30.000000                 0.000000  1.000000

              Siblings/Spouses Aboard  Survived
Sex    Age
female 0.75                  2.000000  1.000000
       1.00                  0.500000  1.000000
       2.00                  1.428571  0.428571
       3.00                  2.333333  0.333333
       4.00                  0.800000  1.000000
...                               ...       ...
male   70.00                 0.500000  0.000000
       70.50                 0.000000  0.000000
       71.00                 0.000000  0.000000
       74.00                 0.000000  0.000000
       80.00                 0.000000  1.000000

[149 rows x 5 columns]

In [36]:
df.pivot_table(index=["Sex", "Pclass"])

                     Age        Fare  Parents/Children Aboard  \
Sex    Pclass
female 1       35.255319  106.125798                 0.457447
       2       28.980263   21.970121                 0.605263
       3       22.135417   16.118810                 0.798611
male   1       41.511639   67.226127                 0.278689
       2       30.493796   19.741782                 0.222222
       3       26.470612   12.695466                 0.227405

               Siblings/Spouses Aboard  Survived
Sex    Pclass
female 1                      0.553191  0.968085
       2                      0.486842  0.921053
       3                      0.895833  0.500000
male   1                      0.311475  0.368852
       2                      0.342593  0.157407
       3                      0.504373  0.137026

In [37]:
df.pivot_table(index=["Sex", "Survived"])

                       Age       Fare  Parents/Children Aboard    Pclass  \
Sex    Survived
female 0         24.419753  23.024385                 1.037037  2.851852
       1         28.866953  51.938573                 0.515021  1.918455
male   0         31.136853  22.066170                 0.209052  2.471983
       1         27.428165  40.821484                 0.357798  2.018349

                 Siblings/Spouses Aboard
Sex    Survived
female 0                        1.209877
       1                        0.515021
male   0                        0.443966
       1                        0.385321

In [38]:
pd.cut(df["Age"], [0, 10, 30, 60, 80], include_lowest=True)

0        (10.0, 30.0]
1        (30.0, 60.0]
2        (10.0, 30.0]
3        (30.0, 60.0]
4        (30.0, 60.0]
            ...
882      (10.0, 30.0]
883      (10.0, 30.0]
884    (-0.001, 10.0]
885      (10.0, 30.0]
886      (30.0, 60.0]
Name: Age, Length: 887, dtype: category
Categories (4, interval[float64]): [(-0.001, 10.0] < (10.0, 30.0] < (30.0, 60.0] < (60.0, 80.0]]